Repository: mailru/nocaptcha-wordpress
Catalog: languages/nocaptcha-*.po
Languages: ru_ru

source: Authorization
ru_ru: Авторизация

source: General Settings
ru_ru: Общие настройки

source: Public Key
ru_ru: Публичный ключ

source: Private Key
ru_ru: Секретный ключ

source: Forms
ru_ru: Формы

source: Use Russian-language widget for languages
ru_ru: Использовать русскоязычный виджет для языков

source: Widget margins
ru_ru: Отступы виджета

source: <p>Before using Nocaptcha service you should <a href="https://nocaptcha.mail.ru/site/add">register</a> your domain and get the public and private keys.</p>
ru_ru: <p>Перед использованием Некапчи необходимо <a href="https://nocaptcha.mail.ru/site/add">зарегистрировать</a> свой домен и получить публичный и секретный ключи.</p>

source: Use top and bottom margins
ru_ru: Использовать отступы снизу и сверху в

source: Do not use margins
ru_ru: Не использовать отступы

source: If necessary, you can adjust the margins in the theme stylesheet.
ru_ru: При необходимости отступы можно настроить внутри стилей темы.

source: Comment form
ru_ru: Форма комментирования

source: Hide CAPTCHA for logged in users
ru_ru: Скрывать капчу для авторизованных пользователей

source: Login form
ru_ru: Форма входа

source: Registration form
ru_ru: Форма регистрации

source: Lost password form
ru_ru: Форма восстановления пароля

source: How to add Nocaptcha to arbitrary form described below.
ru_ru: Как добавить Некапчу в произвольную форму описано ниже.

source: Selected languages
ru_ru: Выбранные языки

source: Available languages
ru_ru: Доступные языки

source: English-language widget will be used for the rest of languages.
ru_ru: Для всех остальных языков будет использоваться англоязычный виджет.

source: Nocaptcha Mail.Ru Settings
ru_ru: Настройки Некапчи Mail.Ru

source: Nocaptcha Mail.Ru
ru_ru: Некапча Mail.Ru

source: How to add Nocaptcha to arbitrary form
ru_ru: Как добавить Некапчу в произвольную форму

source: <p>Next three functions are used for that:</p> <ul> <li> <span class="code">nocaptcha_get_widget( $tabindex = null )</span> &ndash; returns string with widget's HTML code. Optional parameter $tabindex sets tabindex of the CAPTCHA input field. </li> <li> <span class="code">nocaptcha_add_widget( $tabindex = null )</span> &ndash; prints widget's HTML code. Optional parameter $tabindex sets tabindex of the CAPTCHA input field. </li> <li> <span class="code">nocaptcha_check_request()</span> &ndash; checks CAPTCHA code entered by the user. Returns <span class="code">true</span> if check is passed, <span class="code">false</span> if invalid code entered, <span class="code">null</span> if internal error occured. Information about internal error is printed to the PHP error log. </li> </ul> <p>Nocaptcha script will be added to the page's footer if there is at least one widget on the page.</p>
ru_ru: <p>Для этого используются три функции:</p> <ul> <li> <span class="code">nocaptcha_get_widget( $tabindex = null )</span> &ndash; возвращает строку с HTML-кодом виджета. Опциональный параметр $tabindex задает tabindex поля для ввода капчи. </li> <li> <span class="code">nocaptcha_add_widget( $tabindex = null )</span> &ndash; выводит HTML-код виджета с помощью echo. Опциональный параметр $tabindex задает tabindex поля для ввода капчи. </li> <li> <span class="code">nocaptcha_check_request()</span> &ndash; проверяет введенный пользователем код с картинки капчи. Возвращает <span class="code">true</span>, если проверка пройдена, <span class="code">false</span>, если код введен неверно, или <span class="code">null</span>, если случилась внутренняя ошибка. Инфорация о внутренней ошибке добавляется в лог ошибок PHP. </li> </ul> <p>Скрипт для отрисовки будет добавлен в футере страницы, если на странице есть хотя бы один виджет.</p>

source: <strong>ERROR</strong>: Internal service error.
ru_ru: <strong>ОШИБКА</strong>: Внутренняя ошибка сервиса.

source: <strong>ERROR</strong>: Incorrect CAPTCHA code.
ru_ru: <strong>ОШИБКА</strong>: Капча введена неверно.

source: Adds integration with Nocaptcha Mail.Ru - free intelligent CAPTCHA service.
ru_ru: Добавляет интеграцию с Некапчей Mail.Ru - бесплатным сервисом интеллектуальной капчи.
